#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.sops_file.argocd-chart-values: Reading...
data.sops_file.base-chart-values: Reading...
data.sops_file.secrets: Reading...
data.sops_file.argocd-chart-values: Read complete after 0s [id=-]
data.sops_file.base-chart-values: Read complete after 0s [id=-]
data.sops_file.secrets: Read complete after 0s [id=-]
argocd_repository.oci-ghcr: Refreshing state... [id=ghcr.io/actions/actions-runner-controller-charts]
argocd_repository.infra-git: Refreshing state... [id=git@github.com:unerror/infra.git]
argocd_application.vaultwarden: Refreshing state... [id=vaultwarden:default]
data.digitalocean_kubernetes_versions.latest: Reading...
data.digitalocean_project.unerror-network: Reading...
digitalocean_vpc.kubernetes-tor1: Refreshing state... [id=4a6b39e4-844d-4ccf-bb0f-9f71ae432afd]
digitalocean_database_cluster.db-tor1: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c]
digitalocean_database_user.users["homeassistant"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/user/homeassistant]
digitalocean_database_user.users["casdoor"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/user/casdoor]
digitalocean_database_user.users["matrix"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/user/matrix]
digitalocean_database_user.users["discourse"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/user/discourse]
digitalocean_database_user.users["vaultwarden"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/user/vaultwarden]
data.digitalocean_kubernetes_versions.latest: Read complete after 1s [id=terraform-20240522010418162800000001]
digitalocean_database_db.dbs["sliding_sync_proxy"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/sliding_sync_proxy]
digitalocean_database_db.dbs["matrix_ma1sd"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/matrix_ma1sd]
digitalocean_database_db.dbs["matrix_reminder_bot"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/matrix_reminder_bot]
digitalocean_database_db.dbs["vaultwarden"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/vaultwarden]
digitalocean_database_db.dbs["matrix_mautrix_hangouts"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/matrix_mautrix_hangouts]
digitalocean_database_db.dbs["homeserver_synapse"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/homeserver_synapse]
digitalocean_database_db.dbs["matrix_appservice_irc"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/matrix_appservice_irc]
digitalocean_database_db.dbs["matrix_dimension"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/matrix_dimension]
digitalocean_database_db.dbs["casdoor"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/casdoor]
digitalocean_database_db.dbs["discourse"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/discourse]
digitalocean_kubernetes_cluster.une-k8s: Refreshing state... [id=3ea2f22c-674c-4fa4-94d9-509168a2c5bb]
data.digitalocean_project.unerror-network: Read complete after 2s [id=a4076b3f-f3f3-4fb4-a799-6e763bb75942]
digitalocean_database_firewall.firewall: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c-20230214154213473500000001]
digitalocean_project_resources.une-k8s-unerror-network: Refreshing state... [id=a4076b3f-f3f3-4fb4-a799-6e763bb75942]
kubernetes_namespace.une-sys: Refreshing state... [id=une-sys]
kubernetes_secret.dockerlogin: Refreshing state... [id=default/do-docker-registry]
kubernetes_secret.name: Refreshing state... [id=default/age-keyfile]
kubernetes_secret.ghcr-login: Refreshing state... [id=default/ghcr-registry]
digitalocean_database_connection_pool.pools["matrix_mautrix_hangouts"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/matrix_mautrix_hangouts]
digitalocean_database_connection_pool.pools["matrix_dimension"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/matrix_dimension]
digitalocean_database_connection_pool.pools["sliding_sync_proxy"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/sliding_sync_proxy]
digitalocean_database_connection_pool.pools["casdoor"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/casdoor]
digitalocean_database_connection_pool.pools["matrix_reminder_bot"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/matrix_reminder_bot]
digitalocean_database_connection_pool.pools["vaultwarden"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/vaultwarden]
digitalocean_database_connection_pool.pools["matrix_ma1sd"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/matrix_ma1sd]
digitalocean_database_connection_pool.pools["matrix_appservice_irc"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/matrix_appservice_irc]
digitalocean_database_connection_pool.pools["homeserver_synapse"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/homeserver_synapse]
digitalocean_database_connection_pool.pools["discourse"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/discourse]
argocd_project.infra: Refreshing state... [id=infra]
helm_release.base: Refreshing state... [id=base]
time_sleep.base-chart-install: Refreshing state... [id=2021-09-30T14:13:16Z]
helm_release.certs: Refreshing state... [id=certs]
helm_release.argocd: Refreshing state... [id=argocd]
argocd_application.certs: Refreshing state... [id=certs:default]
argocd_application.monitoring: Refreshing state... [id=monitoring:]
argocd_application.csi-s3: Refreshing state... [id=csi-s3:default]
argocd_application.networking: Refreshing state... [id=networking:default]
argocd_application.actions-runner-controller: Refreshing state... [id=actions-runner-controller:default]
argocd_application.base: Refreshing state... [id=base:default]
argocd_application.argocd: Refreshing state... [id=argocd:default]
argocd_application.chatbox: Refreshing state... [id=chatbox:default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # argocd_repository.oci-dockerhub will be created
  + resource "argocd_repository" "oci-dockerhub" {
      + connection_state_status = (known after apply)
      + enable_oci              = true
      + id                      = (known after apply)
      + inherited_creds         = (known after apply)
      + repo                    = "oci://registry-1.docker.io/casbin"
      + type                    = "helm"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @enmand, Action: `pull_request`*